app/Services/ProductsService.php

    public function getAllProduct()
    {
        return $this->product->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL