app/Services/UserService.php

    public function getAllUsers()
    {
        return $this->users->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL