app/Controllers/Admin/CustomerControllers.php

SELECT *
FROM `customer`
WHERE `customer`.`deleted_at` IS NULL
---
    public function listCustomer()
    {
        // Code lấy danh sách khách hàng
        $customerModel = new CustomerModel();
        $listCustomer = $customerModel->findAll(); // Lấy tất cả đơn hàng từ database