app/Controllers/Admin/HomeControllers.php

    public function index(): string
    {
        $userModel = new UserModel();
        $currentUserId = session()->get('id'); // ID người dùng đang đăng nhập
        $dataUser = $userModel->find($currentUserId); // Lấy thông tin user từ database
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '10'

    public function totalProduct()
    {
        $productModel = new ProductModel();
        $condition = [
            'deleted_at' => null,
        ];

        // Đếm số lượng sản phẩm thỏa mãn điều kiện
        $productCount = $productModel->where($condition)
                                      ->whereIn('status_product', [1, 2])
                                      ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `deleted_at` IS NULL
AND `status_product` IN (1,2)
AND `products`.`deleted_at` IS NULL