app/Controllers/Admin/LoginControllers.php

SELECT *
FROM `users`
WHERE `email` = 'dongfoy@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $model->where('email', $email)->first();