app/Controllers/Admin/OrderControllers.php

SELECT *
FROM `orders`
WHERE `orders`.`deleted_at` IS NULL
---
    public function list(): string
    {
        $orderModel = new OrderModel(); // Sử dụng OrderModel để lấy dữ liệu
        $orders = $orderModel->findAll(); // Lấy tất cả đơn hàng từ database