app/Models/CartModel.php

    public function getCartWithProducts($customerId)
    {
        return $this->select('cart.*, products.name, products.price, products.images, products.description')
                    ->join('products', 'products.id_product = cart.id_product') // INNER JOIN với bảng product
                    ->where('cart.customer_id', $customerId)
                    ->where('cart.deleted_at', null) // Nếu bạn có cột `deleted_at` để soft delete
                    ->findAll();
---
SELECT `cart`.*, `products`.`name`, `products`.`price`, `products`.`images`, `products`.`description`
FROM `cart`
JOIN `products` ON `products`.`id_product` = `cart`.`id_product`
WHERE `cart`.`customer_id` IS NULL
AND `cart`.`deleted_at` IS NULL
AND `cart`.`deleted_at` IS NULL