app/Models/CustomerModel.php

SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `deleted_at` IS NULL
AND `customer`.`deleted_at` IS NULL
---
    public function countDataByConditions($conditions)
    {
        return $this->where($conditions)->countAllResults();