app/Models/DistrictsModel.php

SELECT *
FROM `districts`
WHERE `province_id` = '1'
AND `districts`.`deleted_at` IS NULL
---
    public function getDistrictsByProvince($provinceId)
    {
        return $this->where('province_id', $provinceId)->findAll();