app/Models/OrderModel.php

    public function createOrder($data)
    {
        return $this->insert($data); // Insert đơn hàng, sẽ tự động thêm mã đơn hàng khi trước insert
---
INSERT INTO `orders` (`customer_id`, `customer_name`, `customer_email`, `customer_phone`, `total_amount`, `customer_address`, `province_id`, `district_id`, `ward_id`, `note`, `payment_status`, `created_at`, `updated_at`, `order_code`) VALUES ('6', 'Hà Văn Đông', 'testwithdraw001@gmail.com', '0943997901', 15000000, 'số nhà 12, Mễ Trì', '1', '365', '13', 'nhà 12', 'pending', '2024-11-19 08:36:53', '2024-11-19 08:36:53', 'ZZX1DOAC62')