app/Models/ProductModel.php

    public function findAllProvinces()
    {
        // Giả định bạn có một bảng provinces và muốn lấy tất cả các tỉnh
        $provinceModel = new ProvincesModel(); // Đảm bảo bạn đã tạo mô hình ProvinceModel
        return $provinceModel->findAll(); // Trả về tất cả các tỉnh
---
SELECT *
FROM `provinces`
WHERE `provinces`.`deleted_at` IS NULL