app/Models/WardsModel.php

SELECT *
FROM `wards`
WHERE `district_id` = '395'
AND `wards`.`deleted_at` IS NULL
---
    public function getWardsByDistrict($districtId)
    {
        return $this->where('district_id', $districtId)->findAll();