app/Controllers/Users/HomeControllers.php

SELECT *
FROM `cart`
WHERE `deleted_at` IS NULL
AND `customer_id` = '6'
AND `cart`.`deleted_at` IS NULL
---
    private function getTotalCartQuantity()
    {
        $session = session();
        $customerId = $session->get('customer_id');
        $totalQuantity = 0;

        if ($customerId) {
            $dataCartUser = $this->cartModel->where(['deleted_at' => null, 'customer_id' => $customerId])->findAll();

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
---
    public function index()
    {
        $data['cateObj'] = $this->productModel->findAll();
        $data['recommendedProducts'] = $this->productModel->findAll();

SELECT *
FROM `customer`
WHERE `customer_email` = 'dong111@gmail.com'
AND `customer`.`deleted_at` IS NULL
 LIMIT 1
---
    public function login()
    {
        if (session()->has('logged_in') && session()->has('customer_id')) {
            return redirect()->to('/');
        }

        if ($this->request->getMethod() === 'post') {
            $email = $this->request->getPost('customer_email');
            $password = $this->request->getPost('customer_password');
            $customer = $this->customerModel->where('customer_email', $email)->first();

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `products`.`deleted_at` IS NULL
---
    public function product($category = null)
    {
        $data['products'] = $category ?
            $this->productModel->where('category', $category)->paginate(12) :
            $this->productModel->paginate(12);