app/Controllers/Users/HomeControllers.php

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
---
    public function index(): string
    {
        $productModel = new ProductModel();
        $allParam = $productModel->findAll();
        $products = [];
        $data['cateObj'] = $allParam;
        $data['recommendedProducts'] = $productModel->findAll();