app/Controllers/Users/OrderController.php

                    'quantity' => $item['quantity'], // Số lượng sản phẩm
                    'price' => $item['price'], // Giá sản phẩm
                ];
                $orderItemsModel->insert($orderItemData);
---
INSERT INTO `order_items` (`id_order`, `id_product`, `quantity`, `price`, `created_at`) VALUES (20, '22', '1', '15000000.00', '2024-11-19 08:36:53')

    public function clearCart($customerId)
    {
        $cartModel = new CartModel();

        if ($customerId) {
            // For logged-in users, clear cart in database
            $cartModel->where('customer_id', $customerId)->delete();
---
UPDATE `cart` SET `deleted_at` = '2024-11-19 08:36:53'
WHERE `customer_id` = '6'
AND `deleted_at` IS NULL