app/Controllers/Users/ProductsController.php

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
AND `products`.`id_product` = '23'
---
    public function productDetail($productId)
    {
        $productModel = new ProductModel();
        $reviewModel = new ReviewModel();

        // Lấy thông tin sản phẩm
        $product = $productModel->find($productId);
        if (!$product) {
            return redirect()->to('/'); // Hoặc trang lỗi nếu không tìm thấy
        }

        // Lấy danh sách đánh giá cho sản phẩm
        $reviews = $reviewModel->where('id_product', $productId)->findAll();